{
    "navBar":{
        "home":"home",
        "services":"services",
        "about":"about",
        "blogs":"blogs",
        "careers": "careers",
        "projects":"projects",
        "contactUs":"contact us"
    },
    "viewAll": "view all",
    "home":{
        "header": {
            "title": "innovation in Cutting-Edge Technology: Revolutionising the Future",
            "subTitle": "Empowering Innovation for a Digital Tomorrow"
        },
        "cart": {
            "newUser": "Our Projects",
            "activeUsers": "Number Of Clients",
            "satisfiedCustomers": "Satisfied Customers"
        },
        "discover":{
            "title": "We create custom software that users love to use",
            "subTitle": "Over the past 4 years, we've refined our process for custom software development to help achieve our clients' business goals",
            "cart": {
                "titleCuttingEdge": "Assessment",
                "subTitleCuttingEdge": "We conduct a thorough analysis of your current infrastructure to diagnose and document your existing tech environment.",
                "titleSeamlessConnectivity": "Objectives",
                "subTitleSeamlessConnectivity": "We then assist you in defining your technology goals and establishing objectives to achieve throughout our collaboration.",
                "titleIntuitiveUserInterface": "Implementation",
                "subTitleIntuitiveUserInterface": "We bridge the gap between your current state and desired outcomes with a dedicated team of experienced developers."
            }
        },
        "sdlc": {
            "sdlc": "Software Development life cycle",
            "gatheringTitle": "Requirements Gathering",
            "gatheringDescription": "In this stage, we engage with you to understand your needs and expectations from the software system. We identify both functional and non-functional requirements to ensure the final product aligns with your vision.",
            "analysisTitle": "System Analysis",
            "analysisDescription": "We analyze the gathered requirements to define the scope of work and develop a detailed development plan. This includes setting timelines, identifying necessary resources, and estimating costs.",
            "designTitle": "Design",
            "designDescription": "We design the system architecture and various components, focusing on performance, security, and usability. The design is documented to guide the development process and ensure smooth project execution.",
            "implementationTitle": "Implementation",
            "implementationDescription": "We start coding and developing the software components according to the specified design. We use the latest technologies and best practices to ensure quality and efficiency.",
            "testingTitle": "Testing",
            "testingDescription": "We thoroughly test the system to ensure it is free from bugs and functions as expected. This stage includes unit testing, integration testing, and acceptance testing to ensure optimal performance.",
            "integrationTitle": "Integration and Deployment",
            "integrationDescription": "We integrate all the components and the complete system, then deploy it to the production environment. We ensure the system operates correctly and is ready for end-user use.",
            "maintenance": "Maintenance",
            "maintenanceDescription": "After deployment, we provide continuous technical support to address any issues that arise and make necessary improvements and updates to ensure the system's optimal performance."
        }
    }
}